dannyf00/xDuino/board_stm8s103.c
//configure TIM3/CCP1..4
#if defined(USE_T3CCP1) || defined(USE_T3CCP2) || defined(USE_T3CCP3) || defined(USE_T3CCP4)
	//configure the time base: as counter, top at CxCCP_PR-1
	//enable the clock to peripheral
	CLK->PCKENR1 |= CLK_PCKENR1_TIM3;			//'1'=clock enabled, '0'=clock disabled

	//stop the timer
	TIM3->CR1 &=~(1<<0);					//stop the timer
	
	//set up the timer
	TIM3->CR1 = (1<<7) |					//'1'->enable auto reload buffer
	  			(0<<5) |					//'0'->edge aligned. 1..3->center aligned
				(0<<4) |					//'0'->up counter, '1' downcounter
				(0<<3) |					//'0'->continuous mode, '1'->one pulse mode
				(0<<2) |					//'0'-> update enable source
				(0<<1) |					//'0'-> update enabled
				(0<<0);						//'0'->counter disabled
	//TIM3->CR2 = 0;							//default value
	//TIM3->SMCR = 0;							//default value
	//TIM3->ETR = 0;							//'0'->external trigger not inverted
	
	/*TIM3->PSCRH = (TxCCP_PS-1) >> 8;*/ TIM3->PSCR/*L*/ = (TxCCP_PS-1);	//set up the prescaler - msb first
	TIM3->ARRH  = (TxCCP_PR-1) >> 8; TIM3->ARRL  = (TxCCP_PR-1);	//load up the auto reload register - msb first
	TIM3->CNTRH = 0; TIM3->CNTRL = 0;			//reset the counter
	
	TIM3->SR1&=~(0xff);						//clear UIF
	TIM3->IER&=~(0xff);						//'1'->enable overflow interrupt, '0'->disable interrupt

	//configure output compare
#if defined(USE_T3CCP1) && defined(TIM3_CCMR1_RESET_VALUE)
	TIM3->CCMR1 = 	(0<<7) |				//1->clear enabled; 0->clear not enabled
					(6<<4) |				//6->pwm mode 1, 7->pwm mode 2
					(1<<3) |				//0->output preload disabled, 1->output preload enabled
					(0<<2) |				//0->normal operation, 1->enabled output compare fast
					(0<<0) |				//0->output compare as output pin, 1->CC1 as input, 2->CC! as input, 3->CC1 as input
					0x00;
	TIM3->CCER1 = 	(TIM3->CCER1 &~0x0f) |
					(0<<3) |				//1->CC1N active high, 0->CC1N active low
					(0<<2) |				//1->CC1N enabled, 0->CC1N disabled
					(1<<1) |				//0->CC1 normal polarity, 1->CC1 reverse polarity
					(1<<0) |				//1->enable CC1, 0->disable CC1
					0x00;
	TIM3->CCR1H = TIM3->CCR1L = 0;			//0%duty cycle
#endif
	
#if defined(USE_T3CCP2) && defined(TIM3_CCMR2_RESET_VALUE)
	TIM3->CCMR2 = 	(0<<7) |				//1->clear enabled; 0->clear not enabled
					(6<<4) |				//6->pwm mode 1, 7->pwm mode 2
					(1<<3) |				//0->output preload disabled, 1->output preload enabled
					(0<<2) |				//0->normal operation, 1->enabled output compare fast
					(0<<0) |				//0->output compare as output pin, 1->CC1 as input, 2->CC! as input, 3->CC1 as input
					0x00;
	TIM3->CCER1 = 	(TIM3->CCER1 &~0xf0) |
					(0<<7) |				//1->CC1N active high, 0->CC1N active low
					(0<<6) |				//1->CC1N enabled, 0->CC1N disabled
					(1<<5) |				//0->CC1 normal polarity, 1->CC1 reverse polarity
					(1<<4) |				//1->enable CC1, 0->disable CC1
					0x00;
	TIM3->CCR2H = TIM3->CCR2L = 0;			//0%duty cycle
#endif
	
#if defined(USE_T3CCP3) && defined(TIM3_CCMR3_RESET_VALUE)
	TIM3->CCMR3 = 	(0<<7) |				//1->clear enabled; 0->clear not enabled
					(6<<4) |				//6->pwm mode 1, 7->pwm mode 2
					(1<<3) |				//0->output preload disabled, 1->output preload enabled
					(0<<2) |				//0->normal operation, 1->enabled output compare fast
					(0<<0) |				//0->output compare as output pin, 1->CC1 as input, 2->CC! as input, 3->CC1 as input
					0x00;
	TIM3->CCER2 = 	(TIM3->CCER2 &~0x0f) |
					(0<<3) |				//1->CC1N active high, 0->CC1N active low
					(0<<2) |				//1->CC1N enabled, 0->CC1N disabled
					(1<<1) |				//0->CC1 normal polarity, 1->CC1 reverse polarity
					(1<<0) |				//1->enable CC1, 0->disable CC1
					0x00;
	TIM3->CCR3H = TIM3->CCR3L = 0;			//0%duty cycle
#endif
	
#if defined(USE_T3CCP4) && defined(TIM3_CCMR4_RESET_VALUE)
	TIM3->CCMR4 = 	(0<<7) |				//1->clear enabled; 0->clear not enabled
					(6<<4) |				//6->pwm mode 1, 7->pwm mode 2
					(1<<3) |				//0->output preload disabled, 1->output preload enabled
					(0<<2) |				//0->normal operation, 1->enabled output compare fast
					(0<<0) |				//0->output compare as output pin, 1->CC1 as input, 2->CC! as input, 3->CC1 as input
					0x00;
	TIM3->CCER2 = 	(TIM3->CCER2 &~0xf0) |
					(0<<7) |				//1->CC1N active high, 0->CC1N active low
					(0<<6) |				//1->CC1N enabled, 0->CC1N disabled
					(1<<5) |				//0->CC1 normal polarity, 1->CC1 reverse polarity
					(1<<4) |				//1->enable CC1, 0->disable CC1
					0x00;
	TIM3->CCR4H = TIM3->CCR4L = 0;			//0%duty cycle
#endif
	//TIM3->BKR |= (1<<7);					//1->set main-output-enable bit, 0->reset MOE (main-output-enable) bit
	//re-enable the counter
	TIM3->CR1 |= (1<<0);	

#endif
	
	//timer0 is running now
	enableInterrupts();						//enable interrupts globally
}

//return ticks
uint32_t ticks(void) {
	uint32_t m;							//hold overflow count
	uint8_t f;							//hold timer counter - TIMER0 is 8-bit wide

	//perform a double read
	do {
		m = timer_ticks;
		f = TIM4->CNTR;
	} while (m != timer_ticks);			//keep reading until m/f are atomic
	return m | f;						//form the ticks
}

//return time in microseconds
uint32_t micros(void) {
	//return ticks() / (F_CPU / 1000000ul) * 16;		//calculate micro seconds
	return ticks() << 0;								//16:1 prescaler @ 16Mhz F_CPU
}

//return time in milliseconds
uint32_t millis(void) {
	return micros() / 1000;
}

//set pin mode
void pinMode(PIN_T pin, uint8_t mode) {
	GPIO_TypeDef *gpio;
	uint8_t mask;

	if (pin>=DMAX) return;								//invalid pin -> do nothing
	gpio=GPIO_PinDef[pin].gpio;							//get gpio address
	mask=GPIO_PinDef[pin].mask;
	switch (mode) {
		case OUTPUT:		IO_OUT(gpio, mask); break;
		case INPUT_PULLUP:	IO_INPU(gpio, mask); break;
		case INPUT:
		default:			IO_IN(gpio, mask); break;
	}
}

//set pin high/low
void digitalWrite(PIN_T pin, uint8_t state) {
	GPIO_TypeDef *gpio;
	uint8_t mask;

	if (pin>=DMAX) return;				//invalid pin
	gpio=GPIO_PinDef[pin].gpio;							//get gpio address
	mask=GPIO_PinDef[pin].mask;
	if (state == LOW) IO_CLR(gpio, mask); else IO_SET(gpio, mask);
	//if (state) IO_SET(gpio, mask); else IO_CLR(gpio, mask);
}

